/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-1: 
=========================//=========================//=========================
প্রতিদিন তোমার কাজ কি? 
১) রাত ৮ টা বাজে মডিউল আনলক করো  
২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো
৩) ভিডিও দেখতে দেখতে নোটস নাও 
৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো 
৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো 
এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।  */

/* let myToDoList = ['8:00pm Module Unlocking', 'Practise With vedio', 'Doing Notes With Seeing Vedio', 'Practice Module when Finishing full Module'];
for(let i = 1; i <= 10; i++){
    console.log(i);
    for (let i = 0; i < myToDoList.length; i++) {
      const element = myToDoList[i];
      console.log(i, element);
    }
} */


/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-২: 
=========================//=========================//=========================
আবার একই জিনিস while লুপ চালিয়ে ১০ বার দেখানো।  */

// While Loop
/* let i = 1;
while(i <= 10){
    // console.log(i)
    i++
    let j = 1;
    while( j <= myToDoList.length ){
        const element = myToDoList[j];
        // console.log(j,element);
        j++;
    }
} */



/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-৩: 
=========================//=========================//=========================
উপরের প্রব্লেমটাই while লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও  */

// For Loop Reverse 
/* for(i = 10; i >= 1; i-- ){
    console.log(i);
    for (let n = myToDoList.length - 1; n >= 0; n--) {
      console.log(n, myToDoList[n]);
    }
} */



/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-৪: 
=========================//=========================//=========================
উপরের প্রব্লেমটাই for লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও  */

// While Loop Reverse
let i = 10;
while(i >= 1){
    console.log(i);
    i--
    let j = myToDoList.length-1;
    while( j >= 0){
        console.log(myToDoList[j]);
        j--;
    }
}
